#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

int main() {
	int n = 9;
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);

	*pFloat = 9.0;
	printf("num的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}
/*
*pFloat 取 int型9
将 9 拆分：
00000000 00000000 00000000 00001001
0 00000000 0000000000000000001001
符号位 S=0
8位的指数 E=00000000
23位的有效数字 M=00000000000000000001001
由于指数E全为0，所以符合上一节的第二种情况。
因此，浮点数V就写成：V = $(-1)^{0} * 0.00000000000000000001001 * 2^{-126}$ = $1.001 * 2^{-146}$
显然，V是一个很小的接近于0的正数，所以用十进制小数表示就是 0.000000。
*/
/*
int 取 float型9.0
浮点数 9.0 等于二进制的 1001.0，即$1.001*2^{3}$。
s = 0，
M = 001，后边补零凑齐23位
E = 3+127 = 130 即 10000010
0 10000010 00100000000000000000000
这个32位的二进制数，还原成十进制，正是 1091567616
*/

